{
	"title": "Intro to Java Programming",
	"trailer": "https://www.youtube.com/embed/Ayxg5s3Po-c?rel=0",
	"summary": "<p>By the end of this course, you would have learnt about</p><ol><li><strong>Java Constructs</strong><ul><li>Analyze and explain the behavior of programs involving the fundamental program constructs</li><li>Write short programs that use the fundamental program constructs, including standard conditional and iterative control structures</li><li>Identify and correct syntax and logic errors in short programs</li></ul></li><li><strong>Use Java API</strong><ul><li>Write short programs that use strings</li><li>Write short programs that use arrays or array lists</li></ul></li><li><strong>Java Classes & Objects</strong><ul><li>Design and implement a class based on attributes and behaviors of objects</li><li>Construct objects using a class and activate methods on them</li><li>Use static and instance members of a class properly</li><li>Identify and describe the properties of a variable such as its associated value, scope and lifetime</li><li>Describe the parameter passing mechanisms in terms of formal parameters, actual parameters, non-object parameters and object parameters</li></ul></li><li><strong>Java Inheritance</strong><ul><li>Identify super- and subclasses in a class hierarchy</li><li>Recognize and trace overrridden and inherited methods in a class hierarchy</li></ul></li><li><strong>Professional Java Practices</strong><ul><li>Write javadoc comments for classes and methods</li><li>Be able to use an integrated development environment and a debugger</li></ul></li></ol>",
	"whycourse": "Java is one of the most popular programming languages used by software developers today. It is the core language used in developing Android apps, and is also commonly used in back-end web development. If you're new to programming and want to enter either of these fields, this course is a great place to get started.<br/><br/>Even if you don't have a career trajectory in mind, Java programming is a great option for first-time coders due to its popularity and ease of use. This course will provide you with a solid foundation in computer science and Object Oriented Programming concepts, as well as set you on the path for success as a software engineer.",
	"prerequisites": "To participate in this course, please make sure your computer meets the minimum requirements.",
	"syllabus": ["1. Introduction to Java",
				"2. Objects",
				"3. Objects",
				"Problem Set 1",
				"4. Classes",
				"5. Classes",
				"Problem Set 2",
				"6. Fundamental Data Types",
				"7. Fundamental Data Types",
				"8. Decisions",
				"Problem Set 3",
				"9. Loops",
				"Problem Set 4",
				"10. Loops",
				"Problem Set 5",
				"11. ArrayLists and Arrays",
				"Problem Set 6",
				"12. ArrayLists and Arrays",
				"Problem Set 7",
				"13. More About Classes",
				"Problem Set 8",
				"14. Interfaces and Inheritance",
				"Problem Set 9"]
}